IDENTIFICATORDIVISION. PROGRAMID. PROGRAM5.
	
	PROCEDUREDIVISION.	
		
		
		INTEGER MULT10 SECTION. INTEGER nomevar4
	
			BEGINDECLARATIONS
			ENDDECLARATIONS
			
			RETURN nomevar4*10.
			
			ENDCOM.
				
		ENDPROC.
		
		MAIN SECTION.
			
			BEGINDECLARATIONS
				nomevar3 PIC INTEGER.
			ENDDECLARATIONS
			
			MOVE 10 TO nomevar3.
					
			IF TRUE THEN 
				MOVE PERFORM MULT10 USING nomevar3 TO nomevar3. 
				ENDCOM.
			ENDIF.
			
			DISPLAY nomevar3.
			
			
			ENDCOM.
				
		ENDPROC.
				
		
		
	EXIT.
