IDENTIFICATORDIVISION. PROGRAMID. P14.
	
	DATADIVISION. 
		NUM PIC INTEGER.
	EXIT.
	
	PROCEDUREDIVISION.	
			MINHAFUNCAOCOMVARIOSPRMT SECTION. INTEGER PRMT1 INTEGER PRMT2 INTEGER PRMT3
				BEGINDECLARATIONS
				
				ENDDECLARATIONS
		
					DISPLAY PRMT1 + PRMT2.
					
					UNTIL PRMT3 < PRMT1 + PRMT2
						
						MOVE PRMT2 TO NUM.
						
						IF PRMT3 = 100 THEN
							BREAK
							ENDCOM.
						ENDIF.
						
						ENDCOM.
					ENDWHILE.
		
					ENDCOM.
			
			ENDPROC.
	EXIT.
