IDENTIFICATORDIVISION. PROGRAMID. P13.
	DATADIVISION. 
		NUM2A PIC INTEGER.
		BOOLEANO PIC BOOLEAN.
		NUM1A PIC INTEGER.
	EXIT.
	
	PROCEDUREDIVISION.	
			SECAO SECTION. INTEGER MEUPARAM
				BEGINDECLARATIONS
		
				ENDDECLARATIONS
		
					MOVE 5+5+5+5+MEUPARAM TO NUM2A.
					MOVE 10*3*5 TO NUM1A.
					
					UNTIL NUM2A > 10
						DISPLAY NUM1A * NUM2A.
						MOVE NUM2A-1 TO NUM2A.
						ENDCOM.
					ENDWHILE.
					
				ENDCOM.
			ENDPROC.
	EXIT.
