IDENTIFICATORDIVISION. PROGRAMID. RETORNOBOOL.

	DATADIVISION.
		RESULT PIC BOOLEAN.
	EXIT.

	PROCEDUREDIVISION.
	
		MAIN SECTION.
			
			BEGINDECLARATIONS
				A PIC INTEGER.
			ENDDECLARATIONS
			
			MOVE 4 TO A.
			
			MOVE PERFORM ISPAR USING A TO RESULT.
			
			IF RESULT THEN
				DISPLAY 1.
				ENDCOM.
			ELSE
				DISPLAY 0.
				ENDCOM.
			ENDIF.
			ENDCOM.
			
		ENDPROC.
		
		ISPAR SECTION. INTEGER N
		
			BEGINDECLARATIONS
			ENDDECLARATIONS
			
			RETURN (N / 2 = 0).
			
			ENDCOM.
			
		ENDPROC.
	
	EXIT.
	
