IDENTIFICATORDIVISION. PROGRAMID. ATRIBUICAO.

	DATADIVISION.
		
		I PIC INTEGER.
		
		EXIT.
	
	PROCEDUREDIVISION.
	
		MAIN SECTION.
			
			BEGINDECLARATIONS
				
			ENDDECLARATIONS
			
			MOVE 7 TO A.
			
			DISPLAY A.
			
			ENDCOM.
			
		ENDPROC.
		
	
	EXIT.
	
