#IDENTIFICAÇAO DO PROGRAMA (OBRIGATORIO)
IDENTIFICATORDIVISION. PROGRAMID. idQualquer.
	#INICIO DO DATADIVISION(PODE NAO TER)
	DATADIVISION. 
		#INICIO DOS VARDECLARE(PODE NAO TER)
		varIdQualquer PIC INTEGER.
		varIdQqr PIC BOOLEAN.
	#FIM DO DATADIVISION
	EXIT.
	
	#INICIO DO PROCEDURE DIVISION, QUE PODE TER VARIOS PROCEDURES(PODE NAO TER)
	PROCEDUREDIVISION.	
			#COMEÇO DE UM PROCEDURE(PODE NAO TER)
			nomeDaProcedure SECTION. INTEGER exemploDePrmt
				BEGINDECLARATIONS
		
				#PODE TER OU NAO VARDECLARATIONS
		
				ENDDECLARATIONS
		
				#COMANDO OBRIGATORIO, PELO MENOS UM
					
					#EXEMPLOS DE COMANDOS
					MOVE 5+5+5+5 TO NUM2A.
					MOVE 10*3*5 TO NUM1A.
					DISPLAY NUM2A + NUM1A.
		
				#FIM DE TODOS OS COMANDOS
				ENDCOM.
				
			#FIM DA PRECEDURE nomeDaProcedure
			ENDPROC.
			
			
			#PODE TER MAIS PROCEDURES
			
			
	#FIM DE TODOS OS PROCEDURES
	EXIT.
